In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/world_cities.csv', index_col = 0)
df

    City / Urban area     Country  Population  Land area (in sqKm)
0        Buenos Aires   Argentina    11200000                 2266
1           Melbourne   Australia     3162000                 2080
2              Sydney   Australia     3502000                 1687
3            Brisbane   Australia     1508000                 1603
4               Perth   Australia     1177000                  964
..                ...         ...         ...                  ...
245            Canton         USA      267000                  372
246           Spokane         USA      335000                  371
247          Tashkent  Uzbekistan     2200000                  531
248  Ho Chi Minh City     Vietnam     4900000                  518
249            Harare    Zimbabwe     1750000                  712

[249 rows x 4 columns]

## 도시와 나라의 수 구하기

In [3]:
df['Country'].describe() # value_counts().shape을 이용해서 풀 수도 있음

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [4]:
df['City / Urban area'].describe()

count        249
unique       249
top       Manila
freq           1
Name: City / Urban area, dtype: object

## 인구 밀도가 만 명이 넘는 도시

인구 밀도 = 인구 수 / 면적

In [5]:
df["Density"] = df["Population"] / df["Land area (in sqKm)"]

In [6]:
df[df["Density"] > 10000].value_counts().shape

(19,)

## 인구 밀도가 가장 높은 도시

In [7]:
df.loc["Density"] = df['Density']
df.sort_values(by = 'Density', ascending = False)

,City / Urban area,Country,Population,Land area (in sqKm),Density
75,Mumbai,India,14350000.0,484.0,29648.760331
74,Kolkata,India,12700000.0,531.0,23917.137476
101,Karachi,Pakistan,9800000.0,518.0,18918.918919
99,Lagos,Nigeria,13400000.0,738.0,18157.181572
34,Shenzhen,China,8000000.0,466.0,17167.381974
...,...,...,...,...,...
224,Asheville,USA,222000.0,536.0,414.179104
57,Pau,France,181000.0,450.0,402.222222
221,Hickory,USA,188000.0,546.0,344.322344
197,Barnstable Town,USA,244000.0,741.0,329.284750
Density,NaN,NaN,NaN,NaN,NaN

## 차트에 4개의 도시가 있는 나라 찾기

In [31]:
countries = df['Country'].value_counts()
countries

USA          105
France        15
Brazil        10
Canada         9
Germany        8
            ...
Ecuador        1
Nigeria        1
Colombia       1
Vietnam        1
Indonesia      1
Name: Country, Length: 61, dtype: int64

In [32]:
countries[countries == 4]

Italy    4
Name: Country, dtype: int64